open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_counter_arm(unsigned port, uint64_t ticks, bool periodic)
{
    if (port >= OW_COUNTERS || !ticks)
        return -1;
    ow_counter_t *counter = &counters[port];
    if (!counter->open)
        return -1;

    portENTER_CRITICAL(&counter->lock);
    counter->alarm = (gptimer_alarm_config_t) {
        .alarm_count = ticks,
        .reload_count = 0,
        .flags.auto_reload_on_alarm = periodic,
    };
    gptimer_set_raw_count(counter->timer, 0);
    esp_err_t result = gptimer_set_alarm_action(counter->timer, &counter->alarm);
    portEXIT_CRITICAL(&counter->lock);
    if (result != ESP_OK)
        return -1;
    if (!counter->started) {
        if (gptimer_start(counter->timer) != ESP_OK)
            return -1;
        counter->started = true;
    }
    return 0;
}

void IRAM_ATTR ow_counter_reload(unsigned port)
{
    if (port >= OW_COUNTERS)
        return;
    ow_counter_t *counter = &counters[port];
    portENTER_CRITICAL_SAFE(&counter->lock);
    if (counter->started) {
        gptimer_set_raw_count(counter->timer, 0);
        gptimer_set_alarm_action(counter->timer, &counter->alarm);
    }
    portEXIT_CRITICAL_SAFE(&counter->lock);
}

uint64_t ow_counter_read(unsigned port)
{
    uint64_t value = 0;
    if (port < OW_COUNTERS && counters[port].open)
        gptimer_get_raw_count(counters[port].timer, &value);
    return value;
}

void ow_counter_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    if (port >= OW_COUNTERS)
        return;
    ow_counter_t *counter = &counters[port];
    portENTER_CRITICAL(&counter->lock);
    counter->callback = callback;
    portEXIT_CRITICAL(&counter->lock);
}

void ow_counter_close(unsigned port)
{
    if (port >= OW_COUNTERS)
        return;
    ow_counter_t *counter = &counters[port];
    if (counter->timer) {
        if (counter->started)
            gptimer_stop(counter->timer);
        if (counter->enabled)
            gptimer_disable(counter->timer);
        gptimer_del_timer(counter->timer);
    }
    portENTER_CRITICAL(&counter->lock);
    counter->callback = NULL;
    counter->timer = NULL;
    counter->alarm = (gptimer_alarm_config_t) { 0 };
    counter->started = false;
    counter->enabled = false;
    counter->open = false;
    portEXIT_CRITICAL(&counter->lock);
}

#else

int ow_counter_open(unsigned port, unsigned resolution_hz)
{
    (void)port;
    (void)resolution_hz;
    return -1;
}

int ow_counter_arm(unsigned port, uint64_t ticks, bool periodic)
{
    (void)port;
    (void)ticks;
    (void)periodic;
    return -1;
}

void ow_counter_reload(unsigned port)
{
    (void)port;
}

uint64_t ow_counter_read(unsigned port)
{
    (void)port;
    return 0;
}

void ow_counter_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    (void)port;
    (void)callback;
}

void ow_counter_close(unsigned port)
{
    (void)port;
}

#endif

#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"

#if defined(CONFIG_IDF_TARGET_ESP32)

#include "soc/rtc_io_struct.h"
#include "soc/sens_reg.h"
#include "soc/sens_struct.h"

#define OW_GPIO_INTERRUPTS 2

typedef struct {
    unsigned input_gpio;
    bool open;
} ow_gpio_interrupt_t;

static portMUX_TYPE adc_locks[2] = {
    portMUX_INITIALIZER_UNLOCKED,
    portMUX_INITIALIZER_UNLOCKED,
};
static ow_gpio_interrupt_t gpio_interrupts[OW_GPIO_INTERRUPTS];
static volatile uintptr_t gpio_interrupt_callbacks[OW_GPIO_INTERRUPTS];
static unsigned gpio_isr_users;
static bool gpio_isr_service_owned;

static int gpio_isr_acquire(void)
{
    if (gpio_isr_users) {
        ++gpio_isr_users;
        return 0;
    }
    if (gpio_install_isr_service(ESP_INTR_FLAG_IRAM) != ESP_OK)
        return -1;
    gpio_isr_service_owned = true;
    gpio_isr_users = 1;
    return 0;
}

static void gpio_isr_release(void)
{
    if (!gpio_isr_users || --gpio_isr_users)
        return;
    if (gpio_isr_service_owned) {
        gpio_uninstall_isr_service();
        gpio_isr_service_owned = false;
    }
}

static adc_atten_t adc_attenuation(unsigned attenuation)
{
    switch (attenuation) {
    case 0: return ADC_ATTEN_DB_0;
    case 1: return ADC_ATTEN_DB_2_5;
    case 2: return ADC_ATTEN_DB_6;
    default: return ADC_ATTEN_DB_12;
    }
}

int ow_adc_open(unsigned unit, void **handle)
{
    if (!handle || unit > ADC_UNIT_2)
        return -1;

    adc_oneshot_unit_init_cfg_t config = {
        .unit_id = (adc_unit_t)unit,
    };
    if (adc_oneshot_new_unit(&config, (adc_oneshot_unit_handle_t *)handle) != ESP_OK)
        return -1;
    return 0;
}

int ow_adc_input_open(void *handle, unsigned unit, unsigned channel, unsigned attenuation, unsigned bit_width, unsigned default_reference_mv, void **calibration, int *calibration_source)
{
    if (!handle || !calibration || !calibration_source || unit > ADC_UNIT_2 || bit_width == 0)
        return -1;

    adc_atten_t atten = adc_attenuation(attenuation);
    adc_oneshot_chan_cfg_t input_config = {
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
    };
    adc_cali_line_fitting_config_t calibration_config = {
        .unit_id = (adc_unit_t)unit,
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
        .default_vref = default_reference_mv,
    };
    if (adc_oneshot_config_channel((adc_oneshot_unit_handle_t)handle, (adc_channel_t)channel, &input_config) != ESP_OK)
        return -1;
    if (adc_cali_create_scheme_line_fitting(&calibration_config, (adc_cali_handle_t *)calibration) != ESP_OK)
        return -1;
    adc_cali_line_fitting_efuse_val_t source;
    *calibration_source = adc_cali_scheme_line_fitting_check_efuse(&source) == ESP_OK ? (int)source : -1;
    return 0;
}

static uint16_t adc1_read_isr(unsigned channel);

int ow_adc_read(void *handle, unsigned unit, unsigned channel, unsigned *raw)
{
    int value;
    if (!handle || !raw || unit > ADC_UNIT_2)
        return -1;
    if (unit == ADC_UNIT_1) {
        portENTER_CRITICAL(&adc_locks[unit]);
        value = adc1_read_isr(channel);
        portEXIT_CRITICAL(&adc_locks[unit]);
    } else if (adc_oneshot_read((adc_oneshot_unit_handle_t)handle, (adc_channel_t)channel, &value) != ESP_OK) {
        return -1;
    }
    *raw = (unsigned)value;
    return 0;
}

int ow_adc_raw_to_mv(void *calibration, unsigned raw, unsigned *millivolts)
{
    int value;
    if (!calibration || !millivolts || adc_cali_raw_to_voltage((adc_cali_handle_t)calibration, raw, &value) != ESP_OK)
        return -1;
    *millivolts = (unsigned)value;
    return 0;
}

void ow_adc_input_close(void *calibration)
{
    if (calibration)
        adc_cali_delete_scheme_line_fitting((adc_cali_handle_t)calibration);
}

void ow_adc_close(void *handle)
{
    if (handle)
        adc_oneshot_del_unit((adc_oneshot_unit_handle_t)handle);
}

static uint16_t IRAM_ATTR adc1_read_isr(unsigned channel)
{
    SENS.sar_read_ctrl.sar1_dig_force = 0;
    SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
    RTCIO.hall_sens.xpd_hall = false;
    SENS.sar_meas_wait2.force_xpd_amp = SENS_FORCE_XPD_AMP_PD;
    SENS.sar_meas_ctrl.amp_rst_fb_fsm = 0;
    SENS.sar_meas_ctrl.amp_short_ref_fsm = 0;
    SENS.sar_meas_ctrl.amp_short_ref_gnd_fsm = 0;
    SENS.sar_meas_wait1.sar_amp_wait1 = 1;
    SENS.sar_meas_wait1.sar_amp_wait2 = 1;
    SENS.sar_meas_wait2.sar_amp_wait3 = 1;
    SENS.sar_meas_start1.meas1_start_force = 1;
    SENS.sar_meas_start1.sar1_en_pad_force = 1;
    SENS.sar_touch_ctrl1.xpd_hall_force = 1;
    SENS.sar_touch_ctrl1.hall_phase_force = 1;
    SENS.sar_meas_start1.sar1_en_pad = 1U << channel;
    while (SENS.sar_slave_addr1.meas_status != 0) {
    }
    SENS.sar_meas_start1.meas1_start_sar = 0;
    SENS.sar_meas_start1.meas1_start_sar = 1;
    while (SENS.sar_meas_start1.meas1_done_sar == 0) {
    }
    return SENS.sar_meas_start1.meas1_data_sar;
}

