open-watt/urt/src/urt/driver/esp32/ow_shim.c
static void IRAM_ATTR gpio_interrupt_handler(void *context)
{
    unsigned port = (unsigned)(uintptr_t)context;
    bool (*callback)(unsigned) = (bool (*)(unsigned))gpio_interrupt_callbacks[port];
    if (callback && callback(port))
        portYIELD_FROM_ISR();
}

void ow_gpio_interrupt_close(unsigned port);

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    if (port >= OW_GPIO_INTERRUPTS || input_gpio >= SOC_GPIO_PIN_COUNT || trigger > 4)
        return -1;

    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (interrupt->open || gpio_isr_acquire() != 0)
        return -1;
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
        GPIO_INTR_HIGH_LEVEL,
        GPIO_INTR_LOW_LEVEL,
    };
    interrupt->input_gpio = input_gpio;
    // Input buffer explicitly: the pin may be muxed to a peripheral output (only the output path is
    // routed), and edge detection needs GPIO_IN regardless of who drives the pad.
    if (gpio_input_enable((gpio_num_t)input_gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)input_gpio, types[trigger]) != ESP_OK ||
        gpio_isr_handler_add((gpio_num_t)input_gpio, gpio_interrupt_handler, (void *)(uintptr_t)port) != ESP_OK) {
        gpio_isr_release();
        return -1;
    }
    interrupt->open = true;
    return 0;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    gpio_interrupt_callbacks[port] = (uintptr_t)callback;
}

void ow_gpio_interrupt_close(unsigned port)
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (!interrupt->open)
        return;
    gpio_isr_handler_remove((gpio_num_t)interrupt->input_gpio);
    ow_gpio_interrupt_set_callback(port, NULL);
    interrupt->open = false;
    gpio_isr_release();
}

#else

int ow_adc_open(unsigned unit, void **handle)
{
    (void)unit;
    (void)handle;
    return -1;
}

int ow_adc_input_open(void *handle, unsigned unit, unsigned channel, unsigned attenuation, unsigned bit_width, unsigned default_reference_mv, void **calibration, int *calibration_source)
{
    (void)handle;
    (void)unit;
    (void)channel;
    (void)attenuation;
    (void)bit_width;
    (void)default_reference_mv;
    (void)calibration;
    (void)calibration_source;
    return -1;
}

int ow_adc_read(void *handle, unsigned unit, unsigned channel, unsigned *raw)
{
    (void)handle;
    (void)unit;
    (void)channel;
    (void)raw;
    return -1;
}

int ow_adc_raw_to_mv(void *calibration, unsigned raw, unsigned *millivolts)
{
    (void)calibration;
    (void)raw;
    (void)millivolts;
    return -1;
}

void ow_adc_input_close(void *calibration)
{
    (void)calibration;
}

void ow_adc_close(void *handle)
{
    (void)handle;
}

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    (void)port;
    (void)input_gpio;
    (void)trigger;
    return -1;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    (void)port;
    (void)callback;
}

void ow_gpio_interrupt_close(unsigned port)
{
    (void)port;
}

#endif

// -- I2C master wrappers --

#include "driver/i2c_master.h"

#ifdef SOC_HP_I2C_NUM
#define OW_I2C_COUNT SOC_HP_I2C_NUM
#else
#define OW_I2C_COUNT SOC_I2C_NUM
#endif
#define I2C_REQUEST_QUEUE_SIZE 1
#define I2C_WORKER_STACK 3072

typedef bool (*ow_i2c_callback_t)(void *context, int result);

typedef struct {
    uint16_t address;
    uint32_t frequency;
    uint8_t address_mode;
    const void *write_data;
    size_t write_length;
    void *read_data;
    size_t read_length;
    int timeout_ms;
    ow_i2c_callback_t callback;
    void *callback_context;
} ow_i2c_request_t;

typedef struct {
    i2c_master_bus_handle_t bus;
    i2c_master_dev_handle_t device;
    uint16_t address;
    uint32_t frequency;
    uint8_t address_mode;
    QueueHandle_t queue;
    TaskHandle_t worker;
    SemaphoreHandle_t worker_done;
    StaticSemaphore_t worker_done_storage;
    atomic_bool initialized;
} ow_i2c_context_t;

static ow_i2c_context_t i2c_contexts[OW_I2C_COUNT];

static bool ow_i2c_configure_device(ow_i2c_context_t *context, uint16_t address, uint8_t address_mode, uint32_t frequency)
{
    if (context->device && context->address == address && context->address_mode == address_mode && context->frequency == frequency)
        return true;

    if (context->device) {
        if (i2c_master_bus_rm_device(context->device) != ESP_OK)
            return false;
        context->device = NULL;
    }

    i2c_device_config_t device_config = {
        .dev_addr_length = address_mode ? I2C_ADDR_BIT_LEN_10 : I2C_ADDR_BIT_LEN_7,
        .device_address = address,
        .scl_speed_hz = frequency,
    };
    if (i2c_master_bus_add_device(context->bus, &device_config, &context->device) != ESP_OK)
        return false;

    context->address = address;
    context->address_mode = address_mode;
    context->frequency = frequency;
    return true;
}

static int ow_i2c_result(esp_err_t result)
{
    if (result == ESP_OK)
        return 0;
    // ESP-IDF 6.0 i2c_master_transmit(), i2c_master_receive(), and i2c_master_transmit_receive() return this result when a transaction receives NACK.
    if (result == ESP_ERR_INVALID_RESPONSE)
        return 1;
    if (result == ESP_ERR_TIMEOUT)
        return 2;
    return 4;
}

static void ow_i2c_worker(void *argument)
{
    ow_i2c_context_t *context = argument;
    ow_i2c_request_t request;

    while (xQueueReceive(context->queue, &request, portMAX_DELAY) == pdTRUE) {
        if (!request.callback)
            break;

        esp_err_t result = ESP_FAIL;
        if (ow_i2c_configure_device(context, request.address, request.address_mode, request.frequency)) {
            if (request.write_length && request.read_length)
                result = i2c_master_transmit_receive(context->device, request.write_data, request.write_length,
                                                     request.read_data, request.read_length, request.timeout_ms);
            else if (request.write_length)
                result = i2c_master_transmit(context->device, request.write_data, request.write_length, request.timeout_ms);
            else
                result = i2c_master_receive(context->device, request.read_data, request.read_length, request.timeout_ms);
        }
        request.callback(request.callback_context, ow_i2c_result(result));
    }

    xSemaphoreGive(context->worker_done);
    vTaskDelete(NULL);
}

