open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_wifi_init(void)
{
    if (ow_wifi_refcount++ > 0)
        return 0;

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    esp_err_t err = esp_wifi_init(&cfg);
    if (err != ESP_OK)
    {
        ow_wifi_refcount--;
        return (int)err;
    }

    esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &ow_wifi_event_handler, NULL);

#ifdef OW_USE_LWIP
    // Create netifs before RX callbacks fire, so esp_netif_receive() has valid targets.
    if (!ow_wifi_netif_sta)
        ow_wifi_netif_sta = esp_netif_create_default_wifi_sta();
    if (!ow_wifi_netif_ap)
        ow_wifi_netif_ap = esp_netif_create_default_wifi_ap();
    esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &ow_wifi_event_handler, NULL);
#endif

    return 0;
}

void ow_wifi_deinit(void)
{
    if (--ow_wifi_refcount > 0)
        return;

    esp_wifi_stop();
    esp_wifi_deinit();

#ifdef OW_USE_LWIP
    if (ow_wifi_netif_sta)
    {
        esp_netif_destroy(ow_wifi_netif_sta);
        ow_wifi_netif_sta = NULL;
    }
    if (ow_wifi_netif_ap)
    {
        esp_netif_destroy(ow_wifi_netif_ap);
        ow_wifi_netif_ap = NULL;
    }
#endif
}

int ow_wifi_sta_config(const char *ssid, const char *password, const uint8_t *bssid)
{
    wifi_config_t cfg = {0};
    if (ssid)
    {
        size_t len = strlen(ssid);
        if (len > sizeof(cfg.sta.ssid) - 1) len = sizeof(cfg.sta.ssid) - 1;
        memcpy(cfg.sta.ssid, ssid, len);
    }
    if (password)
    {
        size_t len = strlen(password);
        if (len > sizeof(cfg.sta.password) - 1) len = sizeof(cfg.sta.password) - 1;
        memcpy(cfg.sta.password, password, len);
    }
    if (bssid)
    {
        memcpy(cfg.sta.bssid, bssid, 6);
        cfg.sta.bssid_set = true;
    }

    return esp_wifi_set_config(WIFI_IF_STA, &cfg) == ESP_OK ? 1 : 0;
}

int ow_wifi_ap_config(const char *ssid, const char *password, uint8_t channel, uint8_t max_conn, uint8_t hidden)
{
    wifi_config_t cfg = {0};
    if (ssid)
    {
        size_t len = strlen(ssid);
        if (len > sizeof(cfg.ap.ssid) - 1) len = sizeof(cfg.ap.ssid) - 1;
        memcpy(cfg.ap.ssid, ssid, len);
        cfg.ap.ssid_len = (uint8_t)len;
    }
    if (password)
    {
        size_t len = strlen(password);
        if (len > sizeof(cfg.ap.password) - 1) len = sizeof(cfg.ap.password) - 1;
        memcpy(cfg.ap.password, password, len);
        cfg.ap.authmode = (len > 0) ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;
    }
    else
        cfg.ap.authmode = WIFI_AUTH_OPEN;

    cfg.ap.channel = channel;
    cfg.ap.max_connection = max_conn > 0 ? max_conn : 4;
    cfg.ap.ssid_hidden = hidden;

    return esp_wifi_set_config(WIFI_IF_AP, &cfg) == ESP_OK ? 1 : 0;
}

int ow_wifi_ap_set_max_clients(uint8_t max_conn)
{
    wifi_config_t cfg = {0};

    if (esp_wifi_get_config(WIFI_IF_AP, &cfg) != ESP_OK)
        return 0;

    cfg.ap.max_connection = max_conn > 0 ? max_conn : 4;
    return esp_wifi_set_config(WIFI_IF_AP, &cfg) == ESP_OK ? 1 : 0;
}

int ow_wifi_sta_get_ap_info(uint8_t *bssid, int *rssi)
{
    wifi_ap_record_t record;
    if (esp_wifi_sta_get_ap_info(&record) != ESP_OK)
        return 0;

    if (bssid)
        memcpy(bssid, record.bssid, sizeof(record.bssid));
    if (rssi)
        *rssi = record.rssi;
    return 1;
}

// Ethernet frame RX callbacks -- one per netif (STA=0, AP=1).
// esp_wifi_internal_reg_rxcb gives us raw Ethernet frames before lwIP,
// so the bridge/routing layer sees all traffic.

// Return non-zero when the callback retains eb and assumes responsibility for
// releasing it with ow_wifi_free_rx_buffer().
typedef int (*ow_wifi_rx_cb_t)(const uint8_t *data, int len, int iface, void *eb);

static ow_wifi_rx_cb_t ow_wifi_rx_callback;

static esp_err_t ow_wifi_sta_rx(void *buffer, uint16_t len, void *eb)
{
    int retained = 0;
    if (ow_wifi_rx_callback)
        retained = ow_wifi_rx_callback((const uint8_t *)buffer, len, 0, eb);
#ifdef OW_USE_LWIP
    (void)retained;
    return esp_netif_receive(ow_wifi_netif_sta, buffer, len, eb);
#else
    if (eb && !retained)
        esp_wifi_internal_free_rx_buffer(eb);
    return ESP_OK;
#endif
}

static esp_err_t ow_wifi_ap_rx(void *buffer, uint16_t len, void *eb)
{
    int retained = 0;
    if (ow_wifi_rx_callback)
        retained = ow_wifi_rx_callback((const uint8_t *)buffer, len, 1, eb);
#ifdef OW_USE_LWIP
    (void)retained;
    return esp_netif_receive(ow_wifi_netif_ap, buffer, len, eb);
#else
    if (eb && !retained)
        esp_wifi_internal_free_rx_buffer(eb);
    return ESP_OK;
#endif
}

void ow_wifi_free_rx_buffer(void *eb)
{
    if (eb)
        esp_wifi_internal_free_rx_buffer(eb);
}

int ow_wifi_set_rx_callback(ow_wifi_rx_cb_t cb)
{
    ow_wifi_rx_callback = cb;
    esp_err_t err;
    err = esp_wifi_internal_reg_rxcb(WIFI_IF_STA, cb ? &ow_wifi_sta_rx : NULL);
    if (err != ESP_OK)
        return 0;
    err = esp_wifi_internal_reg_rxcb(WIFI_IF_AP, cb ? &ow_wifi_ap_rx : NULL);
    return err == ESP_OK ? 1 : 0;
}

void ow_wifi_set_sta_callback(ow_wifi_event_cb_t cb)
{
    ow_wifi_sta_cb = cb;
}

void ow_wifi_set_ap_callback(ow_wifi_event_cb_t cb)
{
    ow_wifi_ap_cb = cb;
}

// Promiscuous (monitor) mode wrappers. ESP-IDF's promiscuous mode coexists
// with STA/AP -- the radio's channel is what they all share. The callback
// fires for every 802.11 frame the radio decodes, including frames with
// FCS errors when the FCSFAIL filter bit is set.

typedef void (*ow_wifi_promisc_cb_t)(int type, int rssi, int channel,
                                     int rate, int fcs_fail, int len,
                                     const uint8_t *payload);

static ow_wifi_promisc_cb_t ow_wifi_promisc_callback;

static void ow_wifi_promisc_trampoline(void *buf, wifi_promiscuous_pkt_type_t type)
{
    // ESP-IDF reports WIFI_PKT_MISC with metadata but no payload.
    if (!ow_wifi_promisc_callback || !buf || type == WIFI_PKT_MISC)
        return;
    const wifi_promiscuous_pkt_t *pkt = (const wifi_promiscuous_pkt_t *)buf;
    const wifi_pkt_rx_ctrl_t *rx = &pkt->rx_ctrl;
    ow_wifi_promisc_callback((int)type, (int)rx->rssi, (int)rx->channel,
                             (int)rx->rate, (int)rx->rx_state, (int)rx->sig_len,
                             pkt->payload);
}

void ow_wifi_set_promiscuous_callback(ow_wifi_promisc_cb_t cb)
{
    ow_wifi_promisc_callback = cb;
    esp_wifi_set_promiscuous_rx_cb(cb ? &ow_wifi_promisc_trampoline : NULL);
}

int ow_wifi_set_promiscuous(int enable, uint32_t filter_mask)
{
    if (enable)
    {
        wifi_promiscuous_filter_t filt = { .filter_mask = filter_mask };
        esp_wifi_set_promiscuous_filter(&filt);
    }
    return esp_wifi_set_promiscuous(enable ? true : false) == ESP_OK ? 1 : 0;
}

